
## Plan Result (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/48473)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Delete
  * aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446
  * aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2
  * aws_security_group.redis_elasticache_security_group_24BFB83E
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:164" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:884131da5f6a1e837c99bf21a8b6ccd9cccd7d95" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:c79b7bf59b4a22018cd0a6379bb3b8fae76ffbca"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ImageAPI-Prod" -> (known after apply)
      ~ revision                 = 164 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ImageAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446 will be destroyed
  # (because aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446 is not in configuration)
  - resource "aws_elasticache_replication_group" "redis_elasticache_replication_group_6DE00446" {
      - apply_immediately          = true -> null
      - arn                        = "arn:aws:elasticache:us-east-1:996905175585:replicationgroup:imageapi-prod" -> null
      - at_rest_encryption_enabled = false -> null
      - auth_token_update_strategy = "ROTATE" -> null
      - auto_minor_version_upgrade = "true" -> null
      - automatic_failover_enabled = true -> null
      - cluster_enabled            = false -> null
      - data_tiering_enabled       = false -> null
      - description                = "imageapi-prod | Managed by terraform" -> null
      - engine                     = "redis" -> null
      - engine_version             = "7.0" -> null
      - engine_version_actual      = "7.0.7" -> null
      - id                         = "imageapi-prod" -> null
      - ip_discovery               = "ipv4" -> null
      - maintenance_window         = "sun:07:30-sun:08:30" -> null
      - member_clusters            = [
          - "imageapi-prod-001",
          - "imageapi-prod-002",
        ] -> null
      - multi_az_enabled           = true -> null
      - network_type               = "ipv4" -> null
      - node_type                  = "cache.t3.micro" -> null
      - num_cache_clusters         = 2 -> null
      - num_node_groups            = 1 -> null
      - parameter_group_name       = "default.redis7" -> null
      - port                       = 6379 -> null
      - primary_endpoint_address   = "imageapi-prod.zcx42u.ng.0001.use1.cache.amazonaws.com" -> null
      - reader_endpoint_address    = "imageapi-prod-ro.zcx42u.ng.0001.use1.cache.amazonaws.com" -> null
      - replicas_per_node_group    = 1 -> null
      - replication_group_id       = "imageapi-prod" -> null
      - security_group_ids         = [
          - "sg-0d034f8397a83926f",
        ] -> null
      - security_group_names       = [] -> null
      - snapshot_retention_limit   = 0 -> null
      - snapshot_window            = "06:00-07:00" -> null
      - subnet_group_name          = "imageapi-prod-elasticachesubnetgroup" -> null
      - tags                       = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - tags_all                   = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - transit_encryption_enabled = false -> null
      - user_group_ids             = [] -> null
    }

  # aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2 will be destroyed
  # (because aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2 is not in configuration)
  - resource "aws_elasticache_subnet_group" "redis_elasticache_subnet_group_EA2B92B2" {
      - arn         = "arn:aws:elasticache:us-east-1:996905175585:subnetgroup:imageapi-prod-elasticachesubnetgroup" -> null
      - description = "Managed by Terraform" -> null
      - id          = "imageapi-prod-elasticachesubnetgroup" -> null
      - name        = "imageapi-prod-elasticachesubnetgroup" -> null
      - subnet_ids  = [
          - "subnet-610bdb3b",
          - "subnet-b2a036fa",
          - "subnet-cc66bde0",
          - "subnet-d09eb8ec",
        ] -> null
      - tags        = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - tags_all    = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
    }

  # aws_security_group.redis_elasticache_security_group_24BFB83E will be destroyed
  # (because aws_security_group.redis_elasticache_security_group_24BFB83E is not in configuration)
  - resource "aws_security_group" "redis_elasticache_security_group_24BFB83E" {
      - arn                    = "arn:aws:ec2:us-east-1:996905175585:security-group/sg-0d034f8397a83926f" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0d034f8397a83926f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = ""
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6379
            },
        ] -> null
      - name                   = "ImageAPI-Prod20220810190113007000000003" -> null
      - name_prefix            = "ImageAPI-Prod" -> null
      - owner_id               = "996905175585" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - tags_all               = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - vpc_id                 = "vpc-867638e3" -> null
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"51bc47de-0689-4481-80ac-0f54bcceaef4","JobName":"image-api_infrastructure_plan_prod","PRNumber":170,"Program":"tfcmt","SHA1":"c79b7bf59b4a22018cd0a6379bb3b8fae76ffbca","Target":"image-api-cdk","Vars":{}} -->